{
  "_attn_implementation_autoset": true,
  "_name_or_path": "ibm-granite/granite-embedding-small-english-r2",
  "architectures": [
    "ModernBertModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 50281,
  "classifier_activation": "silu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "export_model_type": "transformer",
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 80000,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_activation": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 50283,
  "position_embedding_type": "relative_key_query",
  "reference_compile": null,
  "repad_logits_with_grad": false,
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 50368
}
